{
    "experiences": [
        {
            "title": "Volunteer Data Analyst",
            "subtitle": "Observatório Social do Brasil São Paulo",
            "workType": "Volunteering",
            "workDescription": [
               "Creation of scripts for extracting and analyzing public data, transforming complex information into valuable insights.",
               "Additionally, I developed interactive dashboards to simplify legislative monitoring, facilitating understanding and decision-making."
            ],
            "dateText": "11/2023 – Present"
        },
        {
            "title": "Tech instructor",
            "subtitle": "Udemy",
            "workType": "Self-employed",
            "workDescription": [
               "As an instructor at Udemy, I have the opportunity to share my technology knowledge with thousands of students, inspiring the formation of possible new talents."
            ],
            "dateText": "10/2023 – Present"
        },
        {
            "title": "Programming instructor",
            "subtitle": "Instituto Federal de Alagoas - DIT",
            "workType": "Part-time (temporary)",
            "workDescription": [
                "As an instructor at the Mobile Applications Laboratory at IFAL Campus Arapiraca, I had the opportunity to shape young minds in programming with Javascript.",
                "I prepared engaging classes, developed code examples and evaluated student performance, ensuring their continued growth."
            ],
            "dateText": "03/2023 – 04/2023"
        },
        {
            "title": "Researcher",
            "subtitle": "VTEX Lab",
            "workType": "Part-time",
            "workDescription": [
               "As a researcher in the Tinyverse@VTEX Lab project, I worked on optimizing the performance of the VTEX machine infrastructure.",
               "I developed a Go tool to manage infrastructure environments."
            ],
            "dateText": "07/2021 – 01/2023"
        },
        {
            "title": "Mobile programming instructor",
            "subtitle": "Instituto Federal de Alagoas - DIT",
            "workType": "Part-time (temporary)",
            "workDescription": [
                "As an instructor at the Mobile Applications Laboratory at IFAL Campus Arapiraca, I had the opportunity to inspire students through teaching Flutter.",
                "I created engaging classes, developed example applications and evaluated student performance, ensuring their continued progress."
            ],
            "dateText": "08/2022 – 11/2022"
        },
        {
            "title": "Researcher",
            "subtitle": "Instituto Federal de Alagoas",
            "workType": "Part-Time",
            "workDescription": [
                "I contributed to the development of a gamified version of PreparaIF, an application that prepares students for the IFAL selection exam."
            ],
            "dateText": "09/2020 – 07/2021"
        }
    ]
}